IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_fsi_rx_regs.xml
<module id="FSI_RX_REGS" HW_revision="" description="FSI RX Registers">
	<register id="RX_MAIN_CTRL" width="16" page="1" offset="0x0" internal="0" description="Receive main control register">
		<bitfield id="CORE_RST" description="Receiver Main Core Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INT_LOOPBACK" description="Internal Loopback Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_PAIRING" description="Clock Pairing for SPI-like Behaviour" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INPUT_ISOLATE" description="ISOLATE Input signals" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DATA_FILTER_EN" description="Data Filter Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="RX_OPER_CTRL" width="16" page="1" offset="0x4" internal="0" description="Receive operation control register">
		<bitfield id="DATA_WIDTH" description="Receive Data Width Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SPI_MODE" description="SPI Mode Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="N_WORDS" description="Number of Words to be Received" begin="6" end="3" width="4" rwaccess="RW"/>
		<bitfield id="ECC_SEL" description="ECC Data Width Select" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PING_WD_RST_MODE" description="Ping Watchdog Timeout Mode Select" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_FRAME_INFO" width="16" page="1" offset="0x6" internal="0" description="Receive frame control register">
		<bitfield id="FRAME_TYPE" description="Received Frame Type" begin="3" end="0" width="4" rwaccess="R"/>
	</register>
	<register id="RX_FRAME_TAG_UDATA" width="16" page="1" offset="0x7" internal="0" description="Receive frame tag and user data register">
		<bitfield id="FRAME_TAG" description="Received Frame Tag" begin="4" end="1" width="4" rwaccess="R"/>
		<bitfield id="USER_DATA" description="Received User Data" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="RX_DMA_CTRL" width="16" page="1" offset="0x8" internal="0" description="Receive DMA event control register">
		<bitfield id="DMA_EVT_EN" description="DMA Event Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_EVT_STS" width="16" page="1" offset="0xa" internal="0" description="Receive event and error status flag register">
		<bitfield id="PING_WD_TO" description="Ping Watchdog Timeout Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="FRAME_WD_TO" description="Frame Watchdog Timeout Flag." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CRC_ERR" description="CRC Error Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="TYPE_ERR" description="Frame Type Error Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EOF_ERR" description="End-of-Frame Error Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="BUF_OVERRUN" description="Receive Buffer Overrun Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FRAME_DONE" description="Frame Done Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="BUF_UNDERRUN" description="Receive Buffer Underrun Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ERR_FRAME" description="Error Frame Received Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="PING_FRAME" description="Ping Frame Received Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="FRAME_OVERRUN" description="Frame Overrun Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="DATA_FRAME" description="Data Frame Received Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="PING_TAG_MATCH" description="Ping Tag Match Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="DATA_TAG_MATCH" description="Data Tag Match Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ERROR_TAG_MATCH" description="Error Tag Match Flag" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="RX_CRC_INFO" width="16" page="1" offset="0xb" internal="0" description="Receive CRC info of received and computed CRC">
		<bitfield id="RX_CRC" description="Received CRC Value" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="CALC_CRC" description="Hardware Calculated CRC" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="RX_EVT_CLR" width="16" page="1" offset="0xc" internal="0" description="Receive event and error clear register">
		<bitfield id="PING_WD_TO" description="Ping Watchdog Timeout Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_WD_TO" description="Frame Watchdog Timeout Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRC_ERR" description="CRC Error Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TYPE_ERR" description="Frame Type Error Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EOF_ERR" description="End-of-Frame Error Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BUF_OVERRUN" description="Receive Buffer Overrun Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_DONE" description="Frame Done Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="BUF_UNDERRUN" description="Receive Buffer Underrun Flag Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ERR_FRAME" description="Error Frame Received Flag Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PING_FRAME" description="PING Frame Received Flag Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_OVERRUN" description="Frame Overrun Flag Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="DATA_FRAME" description="Data Frame Received Flag Clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PING_TAG_MATCH" description="Ping Tag Match Flag Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="DATA_TAG_MATCH" description="Data Tag Match Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ERROR_TAG_MATCH" description="Error Tag Match Flag Clear" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_EVT_FRC" width="16" page="1" offset="0xd" internal="0" description="Receive event and error flag force register">
		<bitfield id="PING_WD_TO" description="Ping Watchdog Timeout Flag Force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_WD_TO" description="Frame Watchdog Timeout Flag Force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRC_ERR" description="CRC Error Flag Force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TYPE_ERR" description="Frame Type Error Flag Force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EOF_ERR" description="End-of-Frame Error Flag Force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BUF_OVERRUN" description="Receive Buffer Overrun Flag Force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_DONE" description="Frame Done Flag Force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="BUF_UNDERRUN" description="Receive Buffer Underrun Flag Force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ERR_FRAME" description="Error Frame Received Flag Force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PING_FRAME" description="Ping Frame Received Flag Force" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_OVERRUN" description="Frame Overrun Flag Force" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="DATA_FRAME" description="Data Frame Received Flag Force" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PING_TAG_MATCH" description="Ping Tag Match Flag Force" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="DATA_TAG_MATCH" description="Data Tag Match Flag Force" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ERROR_TAG_MATCH" description="Error Tag Match Flag Force" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_BUF_PTR_LOAD" width="16" page="1" offset="0xe" internal="0" description="Receive buffer pointer load register">
		<bitfield id="BUF_PTR_LOAD" description="Load value for receive buffer pointer" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="RX_BUF_PTR_STS" width="16" page="1" offset="0xf" internal="0" description="Receive buffer pointer status register">
		<bitfield id="CURR_BUF_PTR" description="Current Buffer Pointer Index" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="CURR_WORD_CNT" description="Available Words in Buffer" begin="12" end="8" width="5" rwaccess="R"/>
	</register>
	<register id="RX_FRAME_WD_CTRL" width="16" page="1" offset="0x10" internal="0" description="Receive frame watchdog control register">
		<bitfield id="FRAME_WD_CNT_RST" description="Frame Watchdog Counter Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FRAME_WD_EN" description="Frame Watchdog Counter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_FRAME_WD_REF" width="32" page="1" offset="0x12" internal="0" description="Receive frame watchdog counter reference">
		<bitfield id="FRAME_WD_REF" description="Frame Watchdog Counter Reference Value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RX_FRAME_WD_CNT" width="32" page="1" offset="0x14" internal="0" description="Receive frame watchdog current count">
		<bitfield id="FRAME_WD_CNT" description="Frame Watchdog Counter Value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RX_PING_WD_CTRL" width="16" page="1" offset="0x16" internal="0" description="Receive ping watchdog control register">
		<bitfield id="PING_WD_RST" description="Ping Watchdog Counter Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PING_WD_EN" description="Ping Watchdog Counter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_PING_TAG" width="16" page="1" offset="0x17" internal="0" description="Receive ping tag register">
		<bitfield id="PING_TAG" description="Ping Frame Tag" begin="4" end="1" width="4" rwaccess="R"/>
	</register>
	<register id="RX_PING_WD_REF" width="32" page="1" offset="0x18" internal="0" description="Receive ping watchdog counter reference">
		<bitfield id="PING_WD_REF" description="PING Watchdog Counter Reference Value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RX_PING_WD_CNT" width="32" page="1" offset="0x1a" internal="0" description="Receive pingwatchdog current count">
		<bitfield id="PING_WD_CNT" description="Ping Watchdog Counter Value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RX_INT1_CTRL" width="16" page="1" offset="0x1c" internal="0" description="Receive interrupt control register for RX_INT1">
		<bitfield id="INT1_EN_PING_WD_TO" description="Enable Ping Watchdog Timeout Interrupt to INT1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_FRAME_WD_TO" description="Enable Frame Watchdog Timeout Interrupt to INT1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_CRC_ERR" description="Enable CRC Error Interrupt to INT1" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_TYPE_ERR" description="Enable Frame Type Error Interrupt to INT1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_EOF_ERR" description="Enable End-of-Frame Error Interrupt to INT1" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_OVERRUN" description="Enable Receive Buffer Overrun Interrupt to INT1" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_FRAME_DONE" description="Enable Frame Done Interrupt to INT1" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_UNDERRUN" description="Enable Buffer Underrun Interrupt to INT1" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_ERR_FRAME" description="Enable Error Frame Received Interrupt to INT1" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_PING_FRAME" description="Enable Ping Frame Received Interrupt to INT1" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_FRAME_OVERRUN" description="Enable Frame Overrun Interrupt to INT1" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_DATA_FRAME" description="Enable Data Frame Received Interrupt to INT1" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_PING_TAG_MATCH" description="Enable Ping Frame Tag Matched Interrupt to INT1" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_DATA_TAG_MATCH" description="Enable Data Frame Tag Matched Interrupt to INT1" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_ERROR_TAG_MATCH" description="Enable Error Frame Tag Matched Interrupt to INT1" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_INT2_CTRL" width="16" page="1" offset="0x1d" internal="0" description="Receive interrupt control register for RX_INT2">
		<bitfield id="INT2_EN_PING_WD_TO" description="Enable Ping Watchdog Timeout Interrupt to INT2" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_FRAME_WD_TO" description="Enable Frame Watchdog Timeout Interrupt to INT2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_CRC_ERR" description="Enable CRC Errror Interrupt to INT2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_TYPE_ERR" description="Enable Frame Type Error Interrupt to INT2" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_EOF_ERR" description="Enable End-of-Frame Error Interrupt to INT2" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_OVERRUN" description="Enable Buffer Overrun Interrupt to INT2" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_FRAME_DONE" description="Enable Frame Done Interrupt to INT2" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_UNDERRUN" description="Enable Buffer Underrun Interrupt to INT2" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_ERR_FRAME" description="Enable Error Frame Received Interrupt to INT2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_PING_FRAME" description="Enable Ping Frame Received Interrupt to INT2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_FRAME_OVERRUN" description="Enable Frame Overrun Interrupt to INT2" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_DATA_FRAME" description="Enable Data Frame Received Interrupt to INT2" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_PING_TAG_MATCH" description="Enable Ping Frame Tag Matched Interrupt to INT2" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_DATA_TAG_MATCH" description="Enable Data Frame Tag Matched Interrupt to INT2" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_ERROR_TAG_MATCH" description="Enable Error Frame Tag Matched Interrupt to INT2" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_LOCK_CTRL" width="16" page="1" offset="0x1e" internal="0" description="Receive lock control register">
		<bitfield id="LOCK" description="Control Register Lock Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="RX_ECC_DATA" width="32" page="1" offset="0x20" internal="0" description="Receive ECC data register">
		<bitfield id="DATA_LOW" description="ECC Data Lower 16 Bits" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="DATA_HIGH" description="ECC Data Upper 16 Bits" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RX_ECC_VAL" width="16" page="1" offset="0x22" internal="0" description="Receive ECC value register">
		<bitfield id="ECC_VAL" description="Computed ECC Value" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="RX_ECC_SEC_DATA" width="32" page="1" offset="0x24" internal="0" description="Receive ECC corrected data register">
		<bitfield id="SEC_DATA" description="ECC Single Error Corrected Data" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RX_ECC_LOG" width="16" page="1" offset="0x26" internal="0" description="Receive ECC log and status register">
		<bitfield id="SBE" description="Single Bit Error Detected" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MBE" description="Multiple Bit Errors Detected" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="RX_FRAME_TAG_CMP" width="16" page="1" offset="0x28" internal="0" description="Receive frame tag compare register">
		<bitfield id="TAG_REF" description="Frame Tag Reference" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="TAG_MASK" description="Frame Tag Mask" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CMP_EN" description="Frame Tag Compare Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="BROADCAST_EN" description="Broadcast Enable" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_PING_TAG_CMP" width="16" page="1" offset="0x29" internal="0" description="Receive ping tag compare register">
		<bitfield id="TAG_REF" description="Ping Tag Reference" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="TAG_MASK" description="Ping Tag Mask" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CMP_EN" description="Ping Tag Compare Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="BROADCAST_EN" description="Broadcast Enable" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="RX_TRIG_CTRL_0" width="32" page="1" offset="0x2c" internal="0" description="Receive Trigger Control register 0">
		<bitfield id="TRIG_EN" description="Enable Trigger Function" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIG_SEL" description="Input Select for Trigger" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="RX_TRIG_DLY" description="Delay for Trigger generation" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="RX_TRIG_WIDTH_0" width="32" page="1" offset="0x2e" internal="0" description="Receive Trigger Wdith register 0">
		<bitfield id="RX_TRIG_WIDTH" description="Output Pulse Width" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="RX_DLYLINE_CTRL" width="16" page="1" offset="0x30" internal="0" description="Receive delay line control register">
		<bitfield id="RXCLK_DLY" description="Delay Line Tap Select for RXCLK" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="RXD0_DLY" description="Delay Line Tap Select for RXD0" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="RXD1_DLY" description="Delay Line Tap Select for RXD1" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="RX_TRIG_CTRL_1" width="32" page="1" offset="0x32" internal="0" description="Receive Trigger Control register 1">
		<bitfield id="TRIG_EN" description="Enable Trigger Function" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIG_SEL" description="Input Select for Trigger" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="RX_TRIG_DLY" description="Delay for Trigger generation" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="RX_TRIG_CTRL_2" width="32" page="1" offset="0x34" internal="0" description="Receive Trigger Control register 2">
		<bitfield id="TRIG_EN" description="Enable Trigger Function" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIG_SEL" description="Input Select for Trigger" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="RX_TRIG_DLY" description="Delay for Trigger generation" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="RX_TRIG_CTRL_3" width="32" page="1" offset="0x36" internal="0" description="Receive Trigger Control register 3">
		<bitfield id="TRIG_EN" description="Enable Trigger Function" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIG_SEL" description="Input Select for Trigger" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="RX_TRIG_DLY" description="Delay for Trigger generation" begin="31" end="8" width="24" rwaccess="RW"/>
	</register>
	<register id="RX_VIS_1" width="32" page="1" offset="0x38" internal="0" description="Receive debug visibility register 1">
		<bitfield id="RX_CORE_STS" description="Receiver Core Status" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="RX_UDATA_FILTER" width="16" page="1" offset="0x3a" internal="0" description="Receive User Data Filter Control register">
		<bitfield id="UDATA_REF" description="UserData reference value" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="UDATA_MASK" description="UserData mask  value" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="RX_BUF_BASE" width="16" page="1" offset="0x40" internal="0" description="Base address for receive data buffer">
		<bitfield id="BASE_ADDRESS" description="Receive Data Buffer Base Address" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
</module>
